Reports/ВзаиморасчетыПоМагазинам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>ВзаиморасчетыПоМагазинам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоМагазинам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подробно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/СальдоПоМагазинам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>СальдоПоМагазинам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ВзаиморасчетыПоМагазинам/Ext/ObjectModule.bsl
Процедура Сформировать(ТабДок) Экспорт
	ТабДок.Очистить();
	
	Макет = ПолучитьМакет("Основной");

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьМагазин = Макет.ПолучитьОбласть("Магазин");
	ОбластьГруппа = Макет.ПолучитьОбласть("Группа");
	ОбластьРегистратор = Макет.ПолучитьОбласть("Регистратор");
	ОбластьКомментарий = Макет.ПолучитьОбласть("Комментарий");
	
	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода(НачалоДня(Период.ДатаНачала), КонецДня(Период.ДатаОкончания));
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РегСальдоОстаткиИОбороты.Магазин КАК Магазин,
	|	РегСальдоОстаткиИОбороты.Регистратор КАК Регистратор,
	|	РегСальдоОстаткиИОбороты.Примечание КАК Примечание,
	|	СУММА(РегСальдоОстаткиИОбороты.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	|	СУММА(РегСальдоОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
	|	СУММА(РегСальдоОстаткиИОбороты.СуммаРасход) КАК СуммаРасход,
	|	СУММА(РегСальдоОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.СальдоПоМагазинам.ОстаткиИОбороты(&Дата1, &Дата2, Регистратор, ДвиженияИГраницыПериода) КАК РегСальдоОстаткиИОбороты
	|ГДЕ
	|	ИСТИНА");
	
	Если НЕ Магазин.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И РегСальдоОстаткиИОбороты.Магазин В ИЕРАРХИИ(&Магазин)";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|СГРУППИРОВАТЬ ПО
	|	ТипЗначения(РегСальдоОстаткиИОбороты.Магазин),
	|	РегСальдоОстаткиИОбороты.Магазин,
	|	РегСальдоОстаткиИОбороты.Регистратор,
	|	РегСальдоОстаткиИОбороты.Примечание
	|УПОРЯДОЧИТЬ ПО
	|	ТипЗначения(РегСальдоОстаткиИОбороты.Магазин),
	|	РегСальдоОстаткиИОбороты.Магазин.Наименование,
	|	РегСальдоОстаткиИОбороты.Регистратор.Дата
	|ИТОГИ
	|	СУММА(СуммаНачальныйОстаток),
	|	СУММА(СуммаПриход),
	|	СУММА(СуммаРасход),
	|	СУММА(СуммаКонечныйОстаток)
	|ПО
	|	ОБЩИЕ,
	|	Магазин,
	|	Регистратор
	|	Примечание";

	Запрос.УстановитьПараметр("Дата1", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Магазин", Магазин);

	РезультатЗапроса = Запрос.Выполнить();

	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбщийИтог.Следующий() Цикл
		ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
		ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень());

		Если ПоМагазинам Тогда
			ВыборкаМагазин = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаМагазин.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаМагазин.СуммаНачальныйОстаток) = Ложь И ЗначениеЗаполнено(ВыборкаМагазин.СуммаПриход) = Ложь И ЗначениеЗаполнено(ВыборкаМагазин.СуммаРасход) = Ложь И ЗначениеЗаполнено(ВыборкаМагазин.СуммаКонечныйОстаток) = Ложь Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураРасшифровки = Новый Структура;
				СтруктураРасшифровки.Вставить("Магазин", ВыборкаМагазин.Магазин);
				
				Если ВыборкаМагазин.Магазин.ЭтоГруппа Тогда
					ОбластьГруппа.Параметры.Заполнить(ВыборкаМагазин);
					ОбластьГруппа.Параметры.Расшифровка = СтруктураРасшифровки;
					ТабДок.Вывести(ОбластьГруппа, ВыборкаМагазин.Уровень());
				Иначе
					ОбластьМагазин.Параметры.Заполнить(ВыборкаМагазин);
					ОбластьМагазин.Параметры.Расшифровка = СтруктураРасшифровки;
					ТабДок.Вывести(ОбластьМагазин, ВыборкаМагазин.Уровень());
					
					Если Подробно Тогда
						ВыборкаРегистратор = ВыборкаМагазин.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаРегистратор.Следующий() Цикл
							Если ВыборкаРегистратор.Регистратор <> Неопределено И ВыборкаРегистратор.Регистратор.Дата >= НачалоДня(Период.ДатаНачала) И ВыборкаРегистратор.Регистратор.Дата <= КонецДня(Период.ДатаОкончания) Тогда
								ОбластьРегистратор.Параметры.Заполнить(ВыборкаРегистратор);
								ТабДок.Вывести(ОбластьРегистратор, ВыборкаРегистратор.Уровень());
								
								ВыборкаКомментарий = ВыборкаРегистратор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Пока ВыборкаКомментарий.Следующий() Цикл
									Если ЗначениеЗаполнено(ВыборкаКомментарий.Примечание) И (ЗначениеЗаполнено(ВыборкаКомментарий.СуммаПриход) ИЛИ ЗначениеЗаполнено(ВыборкаКомментарий.СуммаРасход)) Тогда
										ОбластьКомментарий.Параметры.Заполнить(ВыборкаКомментарий);
										ТабДок.Вывести(ОбластьКомментарий, ВыборкаКомментарий.Уровень());
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	// Показать
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
КонецПроцедуры
